
/*
	책의 70% 정도만..!

	1학년떄 C++이란?
	ㆍ클래스 멤버함수, 멤버변수, 살아있는 객체를 만들기 위해서~
	ㆍ살아있는 메모리를 !!ㄴ
	ㆍ객체의 집중을 했었어!!
	ㆍ연산자오버로딩?
	ㆍ하나의 객체가 다른 객체와 잘 어울리게 하기 위해서 상속을 했어!!
	- 이를 위해서 다형성을 했었지!! 그치?
	ㆍ객체 하나와 객체끼리의 관계

	STL (Standard Template Libray)
	ㆍ각각의 객체가 집단으로 묶여있을때 이를 어떻게 다룰 수 있겠니?? 이런거
	ㆍ아주 많은 수의 객체가 있을꺼니깐 자료구조가 어떻게 될 건지?? 알아야지!!
	ㆍContainer
	ㆍDS / Alogorithm 등등

	강의 내용
	ㆍ내년에는 C++17을 배울 예정
	ㆍC++ 11 / 14를 배울 예정
	ㆍ11은 엄청 변하였지만 14에는 minu하게 바뀜
	ㆍ사용법! (이거만 하면 3~4주면 끝나지만!!)
	ㆍ2시간 이론 / 2시간 실습! 인데 사실은 좀 여유롭게 갈 꺼같아
	ㆍ정리된 자료를 주진 않아!

	목표
	ㆍSTL/Template/알고리즘/콜러블타입/람다/Auto등등 배움

	STL~
	ㆍC++ STL이 최고야
	ㆍ왜냐면 이건 자기가 밑바닥으로 들어가서 수정할 수 있어!!

	책
	ㆍ 알지?

	ㆍ퀴즈는 MT정도

	ㆍ과제 1
	- 제작 기간은 한 달
	- 150줄 정도..?

	ㆍ과제2
	- 리플레이!

	ㆍ중간고사는 안봐도 된다드랑
	ㆍ7일 이상 결석하면 안된다!
	ㆍ지각 3번 = 결석 한번
	- 출석부르기 전에 와야한다.
	ㆍ딴짓하지마!!!!!!!!!!!
	ㆍ카톡ㄴ
	ㆍ중간에 오는거 정말 싫어..알겠지?
	ㆍ첫 시간엔 퀴즈를 봅니다!

	//
	 532page;

	 10장에서는 하나만
	 STL 함수 객체, 람다 >ㅁ<

	 7쪽 읽어보세요~



*/